## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be updated in-place
  ~ resource "azurerm_linux_function_app" "observe_collect_function_app" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                = (sensitive value)
          + "WEBSITE_VNET_ROUTE_ALL"                        = "true"
            # (14 unchanged elements hidden)
        }
        id                                             = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-function-vnet/providers/Microsoft.Web/sites/gh-fa-nikhil-function-vnet"
        name                                           = "gh-fa-nikhil-function-vnet"
      ~ tags                                           = {
            "branch"                                         = "nikhil-function-vnet"
            "created_by"                                     = "terraform-ci"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=a73d395d-17c5-40bb-a92b-8eae3af1d626;IngestionEndpoint=https://centralus-0.in.applicationinsights.azure.com/;LiveEndpoint=https://centralus.livediagnostics.monitor.azure.com/;ApplicationId=f6625f16-2466-46d9-a4c1-3b11a696d7b0" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "a73d395d-17c5-40bb-a92b-8eae3af1d626" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-function-vnet/providers/microsoft.insights/components/observeApplicationInsights" -> null
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.terraform-azure-collection.azurerm_subnet.observe_subnet will be created
  + resource "azurerm_subnet" "observe_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "observeSubNet-179969258044-centralus-6c351029"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "gh-rg-nikhil-function-vnet"
      + virtual_network_name                           = "observeVnet-179969258044-centralus-6c351029"
    }

  # module.terraform-azure-collection.azurerm_virtual_network.observe_vnet will be created
  + resource "azurerm_virtual_network" "observe_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "observeVnet-179969258044-centralus-6c351029"
      + resource_group_name = "gh-rg-nikhil-function-vnet"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>